//--------------------------------------------------
//! @file Detect.hpp
//! @brief 物体検出用の処理
//--------------------------------------------------

#pragma once

//--------------------------------------------------
//! @brief 物体検出に使用する設定
//--------------------------------------------------
struct DetectSetting{
	sint	m_minBoxW=-1;												//!< 検出する最小ｻｲｽﾞ幅				// minimum detection width to detect
	sint	m_minBoxH=-1;												//!< 検出する最小ｻｲｽﾞ高さ
	sint	m_maxBoxW=-1;												//!< 検出する最大ｻｲｽﾞ幅
	sint	m_maxBoxH=-1;												//!< 検出する最大ｻｲｽﾞ高さ
};
